"1 394 1 4206624772 ,"
"input 4 1 3 640 640 0 ,"
" 1046 1047 1052 1057 1058 1060 1061 1066 1068 1070 1072 1074 1079 1081 1083 1084 1089 1090 1094 1099 1100 1104 1109 1110 1114 1119 1120 1124 1129 1130 1134 1139 1144 1145 1152 1153 1171 1172 1251 1252 1257 1262 1263 1265 1266 1271 1273 1275 1277 1279 1284 1286 1288 1289 1294 1295 1299 1304 1305 1309 1314 1315 1319 1324 1325 1329 1334 1335 1339 1344 1349 1350 1357 1358 1376 1377 1456 1457 1462 1467 1468 1470 1471 1476 1478 1480 1482 1484 1489 1491 1493 1494 1499 1500 1504 1509 1510 1514 1519 1520 1524 1529 1530 1534 1539 1540 1544 1549 1554 1555 1562 1564 1567 1570 1573 1576 1579 1582 1585 1588 1591 1594 1597 1600 1603 1606 1609 1612 1615 1618 1621 1624 1627 1630 1633 1636 1639 1642 1645 1648 1651 1654 1657 1660 1663 1666 1669 1672 1675 1678 1681 1684 1687 1690 1693 1696 1699 1702 1705 1708 1711 1714 1717 1720 1723 388 389 390 391 392 393 394 395 396 397 398 399 400 401 406 407 410 411 416 417 418 423 434 437 440 441 446 447 448 453 464 467 470 471 476 477 478 483 494 497 500 501 506 507 508 513 518 519 522 523 528 529 530 535 546 549 552 553 558 559 560 565 576 579 582 583 588 589 590 595 606 609 612 613 618 619 620 625 636 639 642 643 648 649 650 655 666 669 672 673 678 679 680 685 696 699 702 703 708 709 710 715 726 729 732 733 738 739 740 745 750 751 754 755 760 761 762 767 778 781 784 785 790 791 792 797 808 811 814 815 820 821 822 827 838 841 844 845 850 851 852 857 858 859 860 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881 882 883 884 885 890 891 892 893 894 895 896 897 898 899 900 901 902 903 904 905 906 907 908 909 910 911 912 913 914 915 916 917 918 919 920 921 922 923 924 925 926 927 928 929 930 931 932 933 934 935 936 937 938 939 940 941 942 943 944 945 946 947 948 966 967 input output ,"
"output ,"
" 393 ,"
"Convolution Conv_0 1 1 input 388 1 3 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_1 1 1 388 389 ,"
"Mul Mul_2 2 1 388 389 390 1 ,"
"Convolution Conv_3 1 1 390 391 1 32 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_4 1 1 391 392 ,"
"Mul Mul_5 2 1 391 392 393 1 ,"
"Convolution Conv_6 1 1 393 394 1 16 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_7 1 1 394 395 ,"
"Mul Mul_8 2 1 394 395 396 1 ,"
"Pooling MaxPool_9 1 1 390 397 0 2 2 2 2 0 0 -1 -1 -1 1 0 0 0 ,"
"Concat Concat_10 2 1 396 397 398 1 ,"
"Convolution Conv_11 1 1 398 399 1 64 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_12 1 1 399 400 ,"
"Mul Mul_13 2 1 399 400 401 1 ,"
"Convolution Conv_14 1 1 401 1564 32 1 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Convolution Conv_15 1 1 1564 1567 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_16 1 1 1567 406 ,"
"Mul Mul_17 2 1 1567 406 407 1 ,"
"Convolution Conv_18 1 1 401 1570 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_19 1 1 1570 410 ,"
"Mul Mul_20 2 1 1570 410 411 1 ,"
"Convolution Conv_21 1 1 411 1573 64 1 64 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Convolution Conv_22 1 1 1573 1576 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_23 1 1 1576 416 ,"
"Mul Mul_24 2 1 1576 416 417 1 ,"
"Concat Concat_25 2 1 407 417 418 1 ,"
"ShuffleChannel Reshape_30 1 1 418 423 2 ,"
"StridedSliceV2 Slice_41 1 1 423 434 1 0 1 64 1 1 1 1 ,"
"StridedSliceV2 Slice_44 1 1 423 437 1 64 1 128 1 1 1 1 ,"
"Convolution Conv_45 1 1 437 1579 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_46 1 1 1579 440 ,"
"Mul Mul_47 2 1 1579 440 441 1 ,"
"Convolution Conv_48 1 1 441 1582 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_49 1 1 1582 1585 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_50 1 1 1585 446 ,"
"Mul Mul_51 2 1 1585 446 447 1 ,"
"Concat Concat_52 2 1 434 447 448 1 ,"
"ShuffleChannel Reshape_57 1 1 448 453 2 ,"
"StridedSliceV2 Slice_68 1 1 453 464 1 0 1 64 1 1 1 1 ,"
"StridedSliceV2 Slice_71 1 1 453 467 1 64 1 128 1 1 1 1 ,"
"Convolution Conv_72 1 1 467 1588 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_73 1 1 1588 470 ,"
"Mul Mul_74 2 1 1588 470 471 1 ,"
"Convolution Conv_75 1 1 471 1591 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_76 1 1 1591 1594 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_77 1 1 1594 476 ,"
"Mul Mul_78 2 1 1594 476 477 1 ,"
"Concat Concat_79 2 1 464 477 478 1 ,"
"ShuffleChannel Reshape_84 1 1 478 483 2 ,"
"StridedSliceV2 Slice_95 1 1 483 494 1 0 1 64 1 1 1 1 ,"
"StridedSliceV2 Slice_98 1 1 483 497 1 64 1 128 1 1 1 1 ,"
"Convolution Conv_99 1 1 497 1597 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_100 1 1 1597 500 ,"
"Mul Mul_101 2 1 1597 500 501 1 ,"
"Convolution Conv_102 1 1 501 1600 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_103 1 1 1600 1603 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_104 1 1 1603 506 ,"
"Mul Mul_105 2 1 1603 506 507 1 ,"
"Concat Concat_106 2 1 494 507 508 1 ,"
"ShuffleChannel Reshape_111 1 1 508 513 2 ,"
"Convolution Conv_112 1 1 513 1606 128 1 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Convolution Conv_113 1 1 1606 1609 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_114 1 1 1609 518 ,"
"Mul Mul_115 2 1 1609 518 519 1 ,"
"Convolution Conv_116 1 1 513 1612 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_117 1 1 1612 522 ,"
"Mul Mul_118 2 1 1612 522 523 1 ,"
"Convolution Conv_119 1 1 523 1615 128 1 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Convolution Conv_120 1 1 1615 1618 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_121 1 1 1618 528 ,"
"Mul Mul_122 2 1 1618 528 529 1 ,"
"Concat Concat_123 2 1 519 529 530 1 ,"
"ShuffleChannel Reshape_128 1 1 530 535 2 ,"
"StridedSliceV2 Slice_139 1 1 535 546 1 0 1 128 1 1 1 1 ,"
"StridedSliceV2 Slice_142 1 1 535 549 1 128 1 256 1 1 1 1 ,"
"Convolution Conv_143 1 1 549 1621 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_144 1 1 1621 552 ,"
"Mul Mul_145 2 1 1621 552 553 1 ,"
"Convolution Conv_146 1 1 553 1624 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_147 1 1 1624 1627 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_148 1 1 1627 558 ,"
"Mul Mul_149 2 1 1627 558 559 1 ,"
"Concat Concat_150 2 1 546 559 560 1 ,"
"ShuffleChannel Reshape_155 1 1 560 565 2 ,"
"StridedSliceV2 Slice_166 1 1 565 576 1 0 1 128 1 1 1 1 ,"
"StridedSliceV2 Slice_169 1 1 565 579 1 128 1 256 1 1 1 1 ,"
"Convolution Conv_170 1 1 579 1630 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_171 1 1 1630 582 ,"
"Mul Mul_172 2 1 1630 582 583 1 ,"
"Convolution Conv_173 1 1 583 1633 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_174 1 1 1633 1636 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_175 1 1 1636 588 ,"
"Mul Mul_176 2 1 1636 588 589 1 ,"
"Concat Concat_177 2 1 576 589 590 1 ,"
"ShuffleChannel Reshape_182 1 1 590 595 2 ,"
"StridedSliceV2 Slice_193 1 1 595 606 1 0 1 128 1 1 1 1 ,"
"StridedSliceV2 Slice_196 1 1 595 609 1 128 1 256 1 1 1 1 ,"
"Convolution Conv_197 1 1 609 1639 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_198 1 1 1639 612 ,"
"Mul Mul_199 2 1 1639 612 613 1 ,"
"Convolution Conv_200 1 1 613 1642 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_201 1 1 1642 1645 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_202 1 1 1645 618 ,"
"Mul Mul_203 2 1 1645 618 619 1 ,"
"Concat Concat_204 2 1 606 619 620 1 ,"
"ShuffleChannel Reshape_209 1 1 620 625 2 ,"
"StridedSliceV2 Slice_220 1 1 625 636 1 0 1 128 1 1 1 1 ,"
"StridedSliceV2 Slice_223 1 1 625 639 1 128 1 256 1 1 1 1 ,"
"Convolution Conv_224 1 1 639 1648 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_225 1 1 1648 642 ,"
"Mul Mul_226 2 1 1648 642 643 1 ,"
"Convolution Conv_227 1 1 643 1651 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_228 1 1 1651 1654 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_229 1 1 1654 648 ,"
"Mul Mul_230 2 1 1654 648 649 1 ,"
"Concat Concat_231 2 1 636 649 650 1 ,"
"ShuffleChannel Reshape_236 1 1 650 655 2 ,"
"StridedSliceV2 Slice_247 1 1 655 666 1 0 1 128 1 1 1 1 ,"
"StridedSliceV2 Slice_250 1 1 655 669 1 128 1 256 1 1 1 1 ,"
"Convolution Conv_251 1 1 669 1657 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_252 1 1 1657 672 ,"
"Mul Mul_253 2 1 1657 672 673 1 ,"
"Convolution Conv_254 1 1 673 1660 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_255 1 1 1660 1663 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_256 1 1 1663 678 ,"
"Mul Mul_257 2 1 1663 678 679 1 ,"
"Concat Concat_258 2 1 666 679 680 1 ,"
"ShuffleChannel Reshape_263 1 1 680 685 2 ,"
"StridedSliceV2 Slice_274 1 1 685 696 1 0 1 128 1 1 1 1 ,"
"StridedSliceV2 Slice_277 1 1 685 699 1 128 1 256 1 1 1 1 ,"
"Convolution Conv_278 1 1 699 1666 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_279 1 1 1666 702 ,"
"Mul Mul_280 2 1 1666 702 703 1 ,"
"Convolution Conv_281 1 1 703 1669 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_282 1 1 1669 1672 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_283 1 1 1672 708 ,"
"Mul Mul_284 2 1 1672 708 709 1 ,"
"Concat Concat_285 2 1 696 709 710 1 ,"
"ShuffleChannel Reshape_290 1 1 710 715 2 ,"
"StridedSliceV2 Slice_301 1 1 715 726 1 0 1 128 1 1 1 1 ,"
"StridedSliceV2 Slice_304 1 1 715 729 1 128 1 256 1 1 1 1 ,"
"Convolution Conv_305 1 1 729 1675 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_306 1 1 1675 732 ,"
"Mul Mul_307 2 1 1675 732 733 1 ,"
"Convolution Conv_308 1 1 733 1678 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_309 1 1 1678 1681 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_310 1 1 1681 738 ,"
"Mul Mul_311 2 1 1681 738 739 1 ,"
"Concat Concat_312 2 1 726 739 740 1 ,"
"ShuffleChannel Reshape_317 1 1 740 745 2 ,"
"Convolution Conv_318 1 1 745 1684 256 1 256 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Convolution Conv_319 1 1 1684 1687 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_320 1 1 1687 750 ,"
"Mul Mul_321 2 1 1687 750 751 1 ,"
"Convolution Conv_322 1 1 745 1690 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_323 1 1 1690 754 ,"
"Mul Mul_324 2 1 1690 754 755 1 ,"
"Convolution Conv_325 1 1 755 1693 256 1 256 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Convolution Conv_326 1 1 1693 1696 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_327 1 1 1696 760 ,"
"Mul Mul_328 2 1 1696 760 761 1 ,"
"Concat Concat_329 2 1 751 761 762 1 ,"
"ShuffleChannel Reshape_334 1 1 762 767 2 ,"
"StridedSliceV2 Slice_345 1 1 767 778 1 0 1 256 1 1 1 1 ,"
"StridedSliceV2 Slice_348 1 1 767 781 1 256 1 512 1 1 1 1 ,"
"Convolution Conv_349 1 1 781 1699 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_350 1 1 1699 784 ,"
"Mul Mul_351 2 1 1699 784 785 1 ,"
"Convolution Conv_352 1 1 785 1702 256 1 256 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_353 1 1 1702 1705 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_354 1 1 1705 790 ,"
"Mul Mul_355 2 1 1705 790 791 1 ,"
"Concat Concat_356 2 1 778 791 792 1 ,"
"ShuffleChannel Reshape_361 1 1 792 797 2 ,"
"StridedSliceV2 Slice_372 1 1 797 808 1 0 1 256 1 1 1 1 ,"
"StridedSliceV2 Slice_375 1 1 797 811 1 256 1 512 1 1 1 1 ,"
"Convolution Conv_376 1 1 811 1708 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_377 1 1 1708 814 ,"
"Mul Mul_378 2 1 1708 814 815 1 ,"
"Convolution Conv_379 1 1 815 1711 256 1 256 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_380 1 1 1711 1714 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_381 1 1 1714 820 ,"
"Mul Mul_382 2 1 1714 820 821 1 ,"
"Concat Concat_383 2 1 808 821 822 1 ,"
"ShuffleChannel Reshape_388 1 1 822 827 2 ,"
"StridedSliceV2 Slice_399 1 1 827 838 1 0 1 256 1 1 1 1 ,"
"StridedSliceV2 Slice_402 1 1 827 841 1 256 1 512 1 1 1 1 ,"
"Convolution Conv_403 1 1 841 1717 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_404 1 1 1717 844 ,"
"Mul Mul_405 2 1 1717 844 845 1 ,"
"Convolution Conv_406 1 1 845 1720 256 1 256 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution Conv_407 1 1 1720 1723 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_408 1 1 1723 850 ,"
"Mul Mul_409 2 1 1723 850 851 1 ,"
"Concat Concat_410 2 1 838 851 852 1 ,"
"ShuffleChannel Reshape_415 1 1 852 857 2 ,"
"Convolution Conv_416 1 1 857 858 1 512 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_417 1 1 858 859 ,"
"Mul Mul_418 2 1 858 859 860 1 ,"
"Upsample Resize_420 1 1 860 865 1 2 2 0 ,"
"Concat Concat_421 2 1 865 745 866 1 ,"
"Convolution Conv_422 1 1 866 867 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_423 1 1 867 868 ,"
"Mul Mul_424 2 1 867 868 869 1 ,"
"Convolution Conv_425 1 1 869 870 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_426 1 1 870 871 ,"
"Mul Mul_427 2 1 870 871 872 1 ,"
"Convolution Conv_428 1 1 872 873 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_429 1 1 873 874 ,"
"Mul Mul_430 2 1 873 874 875 1 ,"
"Convolution Conv_431 1 1 866 876 1 384 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_432 1 1 876 877 ,"
"Mul Mul_433 2 1 876 877 878 1 ,"
"Concat Concat_434 2 1 875 878 879 1 ,"
"Convolution Conv_435 1 1 879 880 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_436 1 1 880 881 ,"
"Mul Mul_437 2 1 880 881 882 1 ,"
"Convolution Conv_438 1 1 882 883 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_439 1 1 883 884 ,"
"Mul Mul_440 2 1 883 884 885 1 ,"
"Upsample Resize_442 1 1 885 890 1 2 2 0 ,"
"Concat Concat_443 2 1 890 513 891 1 ,"
"Convolution Conv_444 1 1 891 892 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_445 1 1 892 893 ,"
"Mul Mul_446 2 1 892 893 894 1 ,"
"Convolution Conv_447 1 1 894 895 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_448 1 1 895 896 ,"
"Mul Mul_449 2 1 895 896 897 1 ,"
"Convolution Conv_450 1 1 897 898 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_451 1 1 898 899 ,"
"Mul Mul_452 2 1 898 899 900 1 ,"
"Convolution Conv_453 1 1 891 901 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_454 1 1 901 902 ,"
"Mul Mul_455 2 1 901 902 903 1 ,"
"Concat Concat_456 2 1 900 903 904 1 ,"
"Convolution Conv_457 1 1 904 905 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_458 1 1 905 906 ,"
"Mul Mul_459 2 1 905 906 907 1 ,"
"Convolution Conv_460 1 1 907 908 1 128 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_461 1 1 908 909 ,"
"Mul Mul_462 2 1 908 909 910 1 ,"
"Concat Concat_463 2 1 910 885 911 1 ,"
"Convolution Conv_464 1 1 911 912 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_465 1 1 912 913 ,"
"Mul Mul_466 2 1 912 913 914 1 ,"
"Convolution Conv_467 1 1 914 915 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_468 1 1 915 916 ,"
"Mul Mul_469 2 1 915 916 917 1 ,"
"Convolution Conv_470 1 1 917 918 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_471 1 1 918 919 ,"
"Mul Mul_472 2 1 918 919 920 1 ,"
"Convolution Conv_473 1 1 911 921 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_474 1 1 921 922 ,"
"Mul Mul_475 2 1 921 922 923 1 ,"
"Concat Concat_476 2 1 920 923 924 1 ,"
"Convolution Conv_477 1 1 924 925 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_478 1 1 925 926 ,"
"Mul Mul_479 2 1 925 926 927 1 ,"
"Convolution Conv_480 1 1 927 928 1 128 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_481 1 1 928 929 ,"
"Mul Mul_482 2 1 928 929 930 1 ,"
"Concat Concat_483 2 1 930 860 931 1 ,"
"Convolution Conv_484 1 1 931 932 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_485 1 1 932 933 ,"
"Mul Mul_486 2 1 932 933 934 1 ,"
"Convolution Conv_487 1 1 934 935 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_488 1 1 935 936 ,"
"Mul Mul_489 2 1 935 936 937 1 ,"
"Convolution Conv_490 1 1 937 938 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_491 1 1 938 939 ,"
"Mul Mul_492 2 1 938 939 940 1 ,"
"Convolution Conv_493 1 1 931 941 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_494 1 1 941 942 ,"
"Mul Mul_495 2 1 941 942 943 1 ,"
"Concat Concat_496 2 1 940 943 944 1 ,"
"Convolution Conv_497 1 1 944 945 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Sigmoid Sigmoid_498 1 1 945 946 ,"
"Mul Mul_499 2 1 945 946 947 1 ,"
"Convolution Conv_500 1 1 907 948 1 128 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Reshape Reshape_514 1 1 948 966 0 5 5 0 3 16 0 80 0 ,"
"Permute Transpose_515 1 1 966 967 5 0 1 3 4 2 ,"
"StridedSliceV2 Slice_576 1 1 967 1046 1 0 1 5 1 4 1 1 ,"
"Sigmoid Sigmoid_577 1 1 1046 1047 ,"
"StridedSliceV2 Slice_582 1 1 967 1052 1 5 1 15 1 4 1 1 ,"
"StridedSliceV2 Slice_587 1 1 967 1057 1 15 1 16 1 4 1 1 ,"
"Sigmoid Sigmoid_588 1 1 1057 1058 ,"
"Concat Concat_590 3 1 1047 1052 1058 1060 4 ,"
"Add Add_591 1 1 1060 1061 0 ,"
"StridedSliceV2 Slice_596 1 1 1061 1066 1 0 1 2 1 4 1 1 ,"
"Mul Mul_598 1 1 1066 1068 1 ,"
"Sub Sub_600 1 1 1068 1070 1 ,"
"Add Add_602 1 1 1070 1072 1 ,"
"Mul Mul_604 1 1 1072 1074 1 ,"
"StridedSliceV2 Slice_609 1 1 1061 1079 1 2 1 4 1 4 1 1 ,"
"Mul Mul_611 1 1 1079 1081 1 ,"
"Power Pow_613 1 1 1081 1083 2 1 0 ,"
"Mul Mul_614 1 1 1083 1084 1 ,"
"StridedSliceV2 Slice_619 1 1 1061 1089 1 5 1 7 1 4 1 1 ,"
"Mul Mul_620 1 1 1089 1090 1 ,"
"Add Add_624 1 1 1090 1094 1 ,"
"StridedSliceV2 Slice_629 1 1 1061 1099 1 7 1 9 1 4 1 1 ,"
"Mul Mul_630 1 1 1099 1100 1 ,"
"Add Add_634 1 1 1100 1104 1 ,"
"StridedSliceV2 Slice_639 1 1 1061 1109 1 9 1 11 1 4 1 1 ,"
"Mul Mul_640 1 1 1109 1110 1 ,"
"Add Add_644 1 1 1110 1114 1 ,"
"StridedSliceV2 Slice_649 1 1 1061 1119 1 11 1 13 1 4 1 1 ,"
"Mul Mul_650 1 1 1119 1120 1 ,"
"Add Add_654 1 1 1120 1124 1 ,"
"StridedSliceV2 Slice_659 1 1 1061 1129 1 13 1 15 1 4 1 1 ,"
"Mul Mul_660 1 1 1129 1130 1 ,"
"Add Add_664 1 1 1130 1134 1 ,"
"StridedSliceV2 Slice_669 1 1 1061 1139 1 4 1 5 1 4 1 1 ,"
"StridedSliceV2 Slice_674 1 1 1061 1144 1 15 1 16 1 4 1 1 ,"
"Concat Concat_675 9 1 1074 1084 1139 1094 1104 1114 1124 1134 1144 1145 4 ,"
"Reshape Reshape_678 1 1 1145 1152 0 3 3 0 -1 16 0 ,"
"Convolution Conv_679 1 1 927 1153 1 128 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Reshape Reshape_693 1 1 1153 1171 0 5 5 0 3 16 0 40 0 ,"
"Permute Transpose_694 1 1 1171 1172 5 0 1 3 4 2 ,"
"StridedSliceV2 Slice_755 1 1 1172 1251 1 0 1 5 1 4 1 1 ,"
"Sigmoid Sigmoid_756 1 1 1251 1252 ,"
"StridedSliceV2 Slice_761 1 1 1172 1257 1 5 1 15 1 4 1 1 ,"
"StridedSliceV2 Slice_766 1 1 1172 1262 1 15 1 16 1 4 1 1 ,"
"Sigmoid Sigmoid_767 1 1 1262 1263 ,"
"Concat Concat_769 3 1 1252 1257 1263 1265 4 ,"
"Add Add_770 1 1 1265 1266 0 ,"
"StridedSliceV2 Slice_775 1 1 1266 1271 1 0 1 2 1 4 1 1 ,"
"Mul Mul_777 1 1 1271 1273 1 ,"
"Sub Sub_779 1 1 1273 1275 1 ,"
"Add Add_781 1 1 1275 1277 1 ,"
"Mul Mul_783 1 1 1277 1279 1 ,"
"StridedSliceV2 Slice_788 1 1 1266 1284 1 2 1 4 1 4 1 1 ,"
"Mul Mul_790 1 1 1284 1286 1 ,"
"Power Pow_792 1 1 1286 1288 2 1 0 ,"
"Mul Mul_793 1 1 1288 1289 1 ,"
"StridedSliceV2 Slice_798 1 1 1266 1294 1 5 1 7 1 4 1 1 ,"
"Mul Mul_799 1 1 1294 1295 1 ,"
"Add Add_803 1 1 1295 1299 1 ,"
"StridedSliceV2 Slice_808 1 1 1266 1304 1 7 1 9 1 4 1 1 ,"
"Mul Mul_809 1 1 1304 1305 1 ,"
"Add Add_813 1 1 1305 1309 1 ,"
"StridedSliceV2 Slice_818 1 1 1266 1314 1 9 1 11 1 4 1 1 ,"
"Mul Mul_819 1 1 1314 1315 1 ,"
"Add Add_823 1 1 1315 1319 1 ,"
"StridedSliceV2 Slice_828 1 1 1266 1324 1 11 1 13 1 4 1 1 ,"
"Mul Mul_829 1 1 1324 1325 1 ,"
"Add Add_833 1 1 1325 1329 1 ,"
"StridedSliceV2 Slice_838 1 1 1266 1334 1 13 1 15 1 4 1 1 ,"
"Mul Mul_839 1 1 1334 1335 1 ,"
"Add Add_843 1 1 1335 1339 1 ,"
"StridedSliceV2 Slice_848 1 1 1266 1344 1 4 1 5 1 4 1 1 ,"
"StridedSliceV2 Slice_853 1 1 1266 1349 1 15 1 16 1 4 1 1 ,"
"Concat Concat_854 9 1 1279 1289 1344 1299 1309 1319 1329 1339 1349 1350 4 ,"
"Reshape Reshape_857 1 1 1350 1357 0 3 3 0 -1 16 0 ,"
"Convolution Conv_858 1 1 947 1358 1 128 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Reshape Reshape_872 1 1 1358 1376 0 5 5 0 3 16 0 20 0 ,"
"Permute Transpose_873 1 1 1376 1377 5 0 1 3 4 2 ,"
"StridedSliceV2 Slice_934 1 1 1377 1456 1 0 1 5 1 4 1 1 ,"
"Sigmoid Sigmoid_935 1 1 1456 1457 ,"
"StridedSliceV2 Slice_940 1 1 1377 1462 1 5 1 15 1 4 1 1 ,"
"StridedSliceV2 Slice_945 1 1 1377 1467 1 15 1 16 1 4 1 1 ,"
"Sigmoid Sigmoid_946 1 1 1467 1468 ,"
"Concat Concat_948 3 1 1457 1462 1468 1470 4 ,"
"Add Add_949 1 1 1470 1471 0 ,"
"StridedSliceV2 Slice_954 1 1 1471 1476 1 0 1 2 1 4 1 1 ,"
"Mul Mul_956 1 1 1476 1478 1 ,"
"Sub Sub_958 1 1 1478 1480 1 ,"
"Add Add_960 1 1 1480 1482 1 ,"
"Mul Mul_962 1 1 1482 1484 1 ,"
"StridedSliceV2 Slice_967 1 1 1471 1489 1 2 1 4 1 4 1 1 ,"
"Mul Mul_969 1 1 1489 1491 1 ,"
"Power Pow_971 1 1 1491 1493 2 1 0 ,"
"Mul Mul_972 1 1 1493 1494 1 ,"
"StridedSliceV2 Slice_977 1 1 1471 1499 1 5 1 7 1 4 1 1 ,"
"Mul Mul_978 1 1 1499 1500 1 ,"
"Add Add_982 1 1 1500 1504 1 ,"
"StridedSliceV2 Slice_987 1 1 1471 1509 1 7 1 9 1 4 1 1 ,"
"Mul Mul_988 1 1 1509 1510 1 ,"
"Add Add_992 1 1 1510 1514 1 ,"
"StridedSliceV2 Slice_997 1 1 1471 1519 1 9 1 11 1 4 1 1 ,"
"Mul Mul_998 1 1 1519 1520 1 ,"
"Add Add_1002 1 1 1520 1524 1 ,"
"StridedSliceV2 Slice_1007 1 1 1471 1529 1 11 1 13 1 4 1 1 ,"
"Mul Mul_1008 1 1 1529 1530 1 ,"
"Add Add_1012 1 1 1530 1534 1 ,"
"StridedSliceV2 Slice_1017 1 1 1471 1539 1 13 1 15 1 4 1 1 ,"
"Mul Mul_1018 1 1 1539 1540 1 ,"
"Add Add_1022 1 1 1540 1544 1 ,"
"StridedSliceV2 Slice_1027 1 1 1471 1549 1 4 1 5 1 4 1 1 ,"
"StridedSliceV2 Slice_1032 1 1 1471 1554 1 15 1 16 1 4 1 1 ,"
"Concat Concat_1033 9 1 1484 1494 1549 1504 1514 1524 1534 1544 1554 1555 4 ,"
"Reshape Reshape_1036 1 1 1555 1562 0 3 3 0 -1 16 0 ,"
"Concat Concat_1037 3 1 1152 1357 1562 output 1 ,"
